2023/mega-doc.org
#+title: Résumé formel de la recherche
#+subtitle: Contrat Été 2023
#+author: Charles-Édouard Lizotte
#+date:28/11/2023
#+LANGUAGE: fr
#+BIBLIOGRAPHY: master-bibliography.bib
#+OPTIONS: toc:nil title:nil 
#+LaTeX_class: org-document

\mytitlepage
\tableofcontents\newpage


* Le modèle en eau peu profonde à plusieurs couches

