2023/Fichiers_tex/mega-doc.tex


\chapter{Le modèle en eau peu profonde à plusieurs couches}
\label{sec:org5bb5a50}

\section{Les équations du mouvement}
\label{sec:org46e7285}

Le système d'équation décrivant l'écoulement dans le modèle en eau peu profonde (\emph{shallow water}) est exprimé par 
\begin{equation}
\label{eq:org08592cd}
   \pdv{\uu_k}{t} + \qty(f+\zeta_k)\pt \kvf\times\uu_k = -\gradient{B_k} + \boldsymbol{D}_k + \delta(k,1)\cdot \qty(\frac{\boldsymbol{\tau_a}}{\rho_o\pt H_k})
   \hspace{0.6cm} \text{où} \hspace{0.6cm} k\pt \in\pt \lbrace 1,\pt2,\cdots ,\pt n_z\rbrace.
\end{equation}
où l'indice \(k\) représente l'indicateur numérique de la couche et \(n_z\) est le nombre total de couches, comme illustré à la figure \ref{org2a7d559}.
Dans l'expression précédente, la fonction de Bernouilli \(B_k\) -- une quantité qui illustre les transferts entre l'énergie cinétique et potentielle -- est exprimée par
\begin{equation}
   B_k =  \rho_k^{-1} p_k^{} + \abs{\uu_k}^2/2.
\end{equation}

Rapidement, \(\uu_k\) est la vitesse du courant horizontal dans la couche \(k\), \(f\) est la fréquence de Coriolis (en \(Rad/s\)), \(\zeta_k\) la vorticité horizontale dans la couche \(k\), la quantité \(\boldsymbol{\tau}_a\) représente la contrainte de cisaillement imposée par le vent à la surface, \(\rho_k\) est la densité de l'eau dans la couche \(k\) et \(H_k\) est l'épaisseur fixe moyenne de cette même couche.
La quantité \(p_s\) représente la pression de surface induite par la surface fixe (\emph{rigid lid}) et le vecteur \(\vb{D}_k\) décrit la dissipation dans chaque couche, nous y reviendrons bientôt.
Il est aussi courant d'utiliser la variable \(\phi_k = \rho_k^{-1} p_k\) en \(\qty[m^2/s^2]\) dans la description du gradient de pression.\bigskip

\begin{wrapfigure}[17]{r}{0.45\textwidth}
\begin{center}
\vspace{-3\baselineskip}
\begin{tikzpicture}[scale=1.1]
% Fond : 
\fill[NavyBlue!5] (0, 0) rectangle (4,-1);
\fill[NavyBlue!10] (0,-1) rectangle (4,-2);
\fill[NavyBlue!15] (0,-2) rectangle (4,-3);
\fill[NavyBlue!20] (0,-3) rectangle (4,-4);
% Lignes 
\draw [ultra thick] (0,0) node [anchor=east] {$\eta_1 = 0$} -- (4,0);
\draw [dotted] (0,-1) -- (4,-1);
\draw [dotted] (0,-2) -- (4,-2);
\draw [dotted] (0,-3) -- (4,-3);
\draw [ultra thick] (0,-4) node [anchor=east] {$\eta_B = 0$} -- (4,-4);
% courbes : 
\draw [ultra thin] (0,-1.2) node [anchor=east] {$\eta_2$} sin (1.2,-0.8) cos (2,-1) sin (2.8,-1.2) cos (4,-0.8);
\draw [ultra thin] (0,-2.2) node [anchor=east] {$\eta_3$} sin (1.2,-1.8) cos (2,-2) sin (2.8,-2.2) cos (4,-1.8);
\draw [ultra thin] (0,-3.2) node [anchor=east] {$\eta_4$} sin (1.2,-2.8) cos (2,-3) sin (2.8,-3.2) cos (4,-2.8);
% Textes : 
\draw (2,0) node [anchor=south] {Surface fixe} ;
\draw (2,-4) node [anchor=north] {Plancher océanique} ;
% H-k
\node at (4.3,-0.5) (H1) {$H_1$};
\node at (4.3,-1.5) (H2) {$H_2$};
\node at (4.3,-2.5) (H3) {$H_3$};
\node at (4.3,-3.5) (H4) {$H_4$};
% d-k
\node at (2,-0.5) (d1) {$h_1$};
\node at (2,-1.5) (d2) {$h_2$};
\node at (2,-2.5) (d3) {$h_3$};
\node at (2,-3.5) (d4) {$h_4$};
% flèches 
\draw[>=stealth, ->|] (H1) -- (4.3, 0); 
\draw[>=stealth, ->|] (H1) -- (4.3,-1);
\draw[>=stealth, -> ] (H2) -- (4.3,-1); 
\draw[>=stealth, ->|] (H2) -- (4.3,-2);
\draw[>=stealth, -> ] (H3) -- (4.3,-2); 
\draw[>=stealth, ->|] (H3) -- (4.3,-3);
\draw[>=stealth, -> ] (H4) -- (4.3,-3); 
\draw[>=stealth, ->|] (H4) -- (4.3,-4);
\end{tikzpicture}
\end{center}
\caption{\label{org2a7d559}Illustration conceptuelle d'un modèle « shallow water » à n\textsubscript{z} = 4 couches. La densité volumique de chaque couche est grossièrement illustrée à l'aide du contrate des couleurs.}
\end{wrapfigure}


Dans l'expression du gradient de la fonction de Bernouilli \(\gradient{B_k}\), la pression  \(p_k\) est décomposée selon la couche, de sorte que
\begin{equation}
    p_k = \left\lbrace\hspace{0.3cm}\begin{matrix}
     p_s & \text{si}\hspace{0.5cm} k=1 \\
     p_{k-1} + \rho_1 g'_k \eta_k & \text{autrement} \\
   \end{matrix}\hspace{0.3cm}\right\rbrace 
\end{equation}
où
\begin{equation}
   g_k' = g \pt\qty(\frac{\rho_k - \rho_{k-1}}{\rho_1}) 
\end{equation}
est la gravité réduite de la couche \(k\).\bigskip

\nb Dans notre propre nomenclature, la quantité « \(\eta_k\) » représente l'élévation de la surface d'une couchex « \emph{k} », en opposition à la nomenclature de \Textcite{vallis_2006}, où \(\eta_k\) représente l'élévation du bas de la couche \(k\).
En cas de doute, se référer à la figure \ref{org2a7d559}).
Le but est de rester cohérent avec l'article de \textcite{chen_2021}.
\bigskip

De leur côté, les termes de dissipation \(\boldsymbol{D}_k\) sont exprimés par
\begin{equation}
   \boldsymbol{D}_k = \underbrace{\tall-A_h\pt\gradient^{\pt4}\pt\uu^{t-1}_k}_\text{Hyperviscosité}
   \ - \ \underbrace{\tall\delta(k,n_z) \cdot r\pt \uu^{t-1}_k,}_{\substack{\text{Frottement}\\\text{au fond}}}
\end{equation}
où l'expression \(\delta(k,i)\) réfère ici au delta de Kronecker qui est l'expression mathématique d'une \emph{switch} dont les valeurs sont 1 lorsque \(k=i\) et 0 autrement,
\begin{equation}
   \delta(k,i) = \left\lbrace \hspace{0.2cm}\begin{matrix}
     \hspace{0.3cm}1 & \text{si}\hspace{0.5cm} k=i, \\
     \hspace{0.3cm}0 & \text{autrement}.
   \end{matrix}\right.
\end{equation}
L'indicateur \(t-1\) réfère au pas de temps précédent, car nous utilisons un schéma temporel de type \emph{leapfrog}.
L'absence d'indice temporel dénote donc le pas de temps courant d'une quantité, soit \(\uu^t\) par exemple. 
Une meilleure description du pas de temps est fournie dans la section \ref{orgcee7815}. \bigskip

\section{Conservation de la masse}
\label{sec:org8503419}

Dans le modèle en eau peu profonde, le système d'équation incarnant la conservation de la masse est donné par
\begin{equation}
   \pdv{h_k}{t} =  \divergence(h_k\uu_k)\ +\ \underbrace{\delta(k,1)\cdot \qty(\divergence{\vb{U}^b}),}_{\substack{\text{Autre transport}\\ \text{de surface}}}
\end{equation}
où \(\vb{U}^b\) pourrait représenter n'importe quel transport de surface, tel que le transport de Stokes, le transport d'Ekman, comme dans \Textcite{chen_2021}.
De base, aucune quantité n'est précisée ici, donc gardons \(\vb{U}^b = 0\). 
