2023/mega-doc.org
** Résolution du gradient de pression
<<sec:gradpress>>

Concrétement, le /timestepping/ de type /leapfrog/ pour les équations du mouvement est exprimé par
#+NAME:eq:leapfrog
\begin{equation}
 \uu^{t+1}_k = \underbrace{ \uu^{t-1}_k + (2\Delta t)\cdot \vb*{G}^t_k}_{\tilde{\uu}_k} \ -\ \gradient{\phi_s}.
\end{equation}
où $\vb{G}^t$ est un vecteur valise qui contient tout le /RHS/ des équations [[eq:mvmt]], mais sans le terme de pression de surface ($\gradient{\phi_s}$).
Le terme $\boldsymbol{G}_k^t$ est calculé au pas de temps courant de manière à s'incruster dans le /timestepping/ de type /leapfrog/.
Ainsi, l'expression
\begin{equation}
   \tilde{\uu}^{t+1}_k = \uu^{t-1}_k + (2\Delta t)\cdot \vb*{G}^t_k,
\end{equation}
représente donc le nouveau courant sans la correction associée à la pression de surface, qui est pour l'instant inconnue.\bigskip


Conceptuellement, on peut décomposer notre courant en deux sections, soit une composante /barotrope/ et une composante /barocline/.
La composante barotrope est le courant moyenné par l'épaisseur des couches, tandis que la composante barocline représente l'anomalie par rapport à cette moyenne, de sorte à retrouver
\begin{subequations}
\begin{align}
 && \tilde{\uu}_{BT} = \frac{1}{H} \qty(\sum_k^n d_k \tilde{\uu}_k) && \text{et}
 && \tilde{\uu}_{BC,\pt k} = \tilde{\uu}_k - \tilde{\uu}_{BT}. &&
\end{align}
\end{subequations}

Puis à l'aide de ce courant barotrope, on peut construire une vorticité barotrope
\begin{equation}
 \tilde{\zeta}_{BT} = \kvf \cdot \qty[\curl{\tilde{\uu}_{BT}}],
\end{equation}
qui est définit sur toute la hauteur de la colone d'eau.\bigskip

Mais on peut aussi calculer la vorticité de notre futur courant, de sorte à retrouver
\begin{align}
& \zeta^{t+1}_{BT} = \kvf \cdot \qty[\curl{\uu^{t+1}_{BT}}],\venti\nonumber\\
& \zeta^{t+1}_{BT} = \kvf \cdot \qty[\curl(\tilde{\uu}_{BT} + \gradient{\phi_s})],\venti\nonumber\\
& \zeta^{t+1}_{BT} = \kvf \cdot \qty[\curl{\tilde{\uu}_{BT}}] + \cancelto{0}{\kvf\cdot\qty[\curl{\gradient{\phi_s}}]}.
\end{align}
Comme le rotationnel d'unpp gradient est toujours nul, on arrive à la conclusion inévitable que
\begin{equation}
 \zeta^{t+1}_{BT} = \tilde{\zeta}_{BT}.
\end{equation}
La correspondance entre la vorticité relative est donnée par $\zeta = \laplacian{\psi}$, donc on obtient une nouvelle équation de Poisson donnée par
\begin{equation}
\boxed{\hspace{0.3cm}
 \laplacian{\psi_{BT}^{t+1}} = \kvf \cdot \qty[\curl{\tilde{\uu}_{BT}}]
 \hspace{0.31cm}\text{avec C.F. Dirichlet}\hspace{0.31cm}
 \eval{\psi_{BT}\pt}_{x_0,\pt x_f} = \ \eval{\psi_{BT}\pt}_{y_0,\pt y_f} = 0.
\hspace{0.3cm} }
\end{equation}
Donc en trouvant $\psi_{BT}$ à l'aide d'un solveur elliptique (Fishpack dans notre cas), on trouve aussi $\uu_{BT}$ à l'aide de la relation avec la fonction de courant,
\begin{align}
&&u = -\pdv{\psi}{y} &&\text{et} && v = \pdv{\psi}{x}.&&
\end{align}
Puis finalement, on recombine les courants mis-à-jour à l'aide de la relation
\begin{align}
 \uu^{t+1}_k =&\pt \uu_{BT} + \uu_{BC,\pt k} \\
            =&\pt \curl{\qty(\kvf\psi_{BT})} + \uu_{BC,\pt k},
\end{align}
où $\uu_{BC} = \tilde{\uu}_{BC}$ comme $\gradient{\phi_s}$ est une composante barotrope.\newpage

** Conditions frontières

#+CAPTION: Représentation de la grille numérique utilisée pour le modèle en eau peu profonde (type [[https://en.wikipedia.org/wiki/Arakawa_grids][Arakawa-C]] )
#+NAME: fig:grille
\begin{wrapfigure}[18]{r}{0.4\textwidth}
\vspace{-\baselineskip}
\centering
\begin{tikzpicture}[scale=2.4]
% Grille : 
\draw[step=1.0,black,dotted] (0.85,0.85) grid (3.25,3.25);
\draw[MidnightBlue!15, line width = 3.5pt] (3.25,1) -- (1,1) -- (1,3.25);
\draw[MidnightBlue] (1,3.4) node {Mur};
% Flèches en v : 
\foreach \x in {1,2}
\foreach \y in {1,2,3}
{
    \draw [-{latex},red]
              (\x + 0.5, \y - 0.1 ) --
              (\x + 0.5, \y + 0.1);
    \draw [] (\x + 0.5, \y + 0.0) node [red,right] {$v\pt [\x,\y]$};
}
% Flèches en u :
\foreach \x in {1,2,3}
\foreach \y in {1,2}
{
    \draw [-{latex},blue](\x - 0.1 , \y + 0.5 ) --
              node [below,blue] {$u\pt[\x,\y]$}
              (\x + 0.1, \y + 0.5);
}
% Points aux coins :
\foreach \x in {1,2,3}
\foreach \y in {1,2,3}
{
\fill [black] (\x, \y) circle (0.5pt);
}
% Milieux :
\foreach \x in {1,2}
\foreach \y in {1,2}
{\draw (\x+0.5,\y+0.5) node [] {$\qty[\pt\x,\y\pt]$} ;}
% Flèches
\node [] at (1.5,0.75) (dx1) {$\Delta x$};
\draw [-{latex}|] (dx1) -- (1,0.75);
\draw [-{latex}|] (dx1) -- (2,0.75);
\node [] at (0.70,1.5) (dy1) {$\Delta y$};
\draw [-{latex}|] (dy1) -- (0.70,1);
\draw [-{latex}|] (dy1) -- (0.70,2);
\end{tikzpicture}
\end{wrapfigure}

*** Conditions frontière sur les courants (No normal flow)
Aux murs, nous appliquons la condition /no normal flow/ (ou la condition d'imperméabilité).
Cette condition de type Dirichlet est caractérisée par un courant normal nul aux frontières.
Mathématiquement, la condition se traduit par
\begin{equation}
\uu \cdot \nvf =0,
\end{equation}
où $\nvf$ est le vecteur normal à la frontière.
Numériquement, on peut énoncer que sur une grille cartésienne la condition /no normal flow/ symbolise
\begin{subequations}
\begin{align}
  &&(\text{Front. verticales}) && u\pt[1\pt,:]\ =\ u\pt[nx,:\pt] = 0,&& \\
  &&(\text{Front. horizontales}) && v\pt[:\pt,1]\ =\ v\pt[:\pt,ny] = 0.&&  
\end{align}
\end{subequations}

Avec nos points fantômes, on peut étendre les extrémités des frontières et affirmer que ces derniers sont aussi reliés par les relations
\begin{subequations}
\begin{align}
(\text{Courant }u) &&  u\pt[0,\pt:\pt] = u\pt[1,\pt:\pt] && \text{et} && u\pt[nx+1,\pt:\pt] &= u\pt[\pt:\pt,ny],&&\\
(\text{Courant }v) &&  v\pt[\pt:\pt,0] = v\pt[\pt:\pt,1] && \text{et} && v\pt[\pt:\pt,ny+1] &= v\pt[nx,\pt:\pt].&&
\end{align}
\end{subequations}

*** Conditions frontières sur la dérivée première (Free slip condition)

La seconde condition est la /free slip condition/ (ou la condition de glissement libre).
La /free slip condition/ tient à l'hypothèse que la couche limite est si petite qu'on peut essentiellement l'ignorer, ce qui est souvent le cas pour l'étude des fluides à grande échelle.
Concrétement, il n'y a [[https://physics.stackexchange.com/questions/383096/understanding-free-slip-boundary-condition#:~:text=On%20the%20other%20hand%2C%20the,the%20tangential%20component%20is%20unrestricted.][pas de contrainte de cisaillement au mur]], de sorte que
#+NAME: eq:shear-stress
\begin{align}
&&\eval{\qty(\boldsymbol{\tau}_x = \mu \pdv{u}{y})\pt }_{\pt\{xi,xf\}} = 0\pt, && \text{et} &&
  \eval{\qty(\boldsymbol{\tau}_y = \mu \pdv{v}{x})\pt }_{\pt\{yi,yf\}} = 0\pt. &&
\end{align}
où $\mu$ est la viscosité [cite:@tan2018applying].
Ainsi, l'expression [[eq:shear-stress]] force la condition frontière sur la dérivée première à satisfaire 
\begin{equation}
\boxed{\hspace{0.7cm}\eval{\pdv{v}{x}\pt }_{\pt\{xa,xf\}} = 0\pt\ \forall\ y,\hspace{1.3cm} \text{et} \hspace{1.3cm} \eval{\pdv{u}{y}\pt }_{\pt \{yi,yf\}} = 0\pt\ \forall\ x.\hspace{0.7cm}\venti}
\end{equation}
Ce qui se traduit concrétement par
\begin{subequations}
\begin{align}
(\text{Courant }u) &&  u\pt[\pt:\pt,0] = u\pt[\pt:\pt,1] && \text{et} && u\pt[\pt:\pt,ny+1] &= u\pt[\pt:\pt,ny],&&\\
(\text{Courant }v) &&  v\pt[0,\pt:\pt] = v\pt[1,\pt:\pt] && \text{et} && v\pt[nx+1,\pt:\pt] &= v\pt[nx,\pt:\pt].&&
\end{align}
\end{subequations}

*** Condition sur les laplaciens et la fonction de courant
Au murs, on retrouve les quantités $\gradient^2{\uu}$, $\gradient^2{\vv}$, $\zeta$ et $\psi$.
Pour se simplifier la tâche et faire comme dans l'article de [cite:@duhaut2006], on applique
\begin{equation}
   \eval{\gradient^2\pt\uu = \gradient^2\pt\vv = \psi = \zeta =  0\ }_\text{au mur}.
\end{equation}


* Aperçu théorique de l'ajout des vagues au modèle en eau peu profonde

