2023/mega-doc.org
** La dérive de Stokes selon [cite/a/cf:@suzuki2016understanding]

\nb Comme dans la notation de [cite/t/cf:@vallis_2006], le vecteur $\vv = \qty(u,v,w)$ dénote le courant d'un écoulement 3D, tandis que le vecteur $\uu = (u,v)$ est en deux dimensionslp.\bigskip

On peut définir une dérive de Stokes ($\vv_S$) lorsqu'il y a un fort rapports suffisant d'échelle en dimension et en temps entre les vagues et la circulation.
Comme l'expriment [cite/t/cf:voir @suzuki2016understanding pour un résumé],\smallskip
#+begin_quote
   « /For these equations to be valid, there must be a separation of horizontal and temporal scales between the waves and the circulation, and the steepness of the waves must be limited [McWilliams et al., 2004].
   In the coastal zone, strong variations of currents and surf zones may violate these limitations, but in open water they are more easily satisﬁed. »/\bigskip
#+end_quote
ce qui nous permet de /filter/ la dynamique des vagues pour étudier la dérive de Stokes comme une propriété émergente de l'effet des vagues. \bigskip

[cite/t/cf:@suzuki2016understanding]  caractérisent la dérive de Stokes ($\vv_S$) comme un courant lagrangien (/wave-ﬁltered Lagrangian velocity/).
Dans le langage courant, un *quantité lagrangienne* se fait advecter (p.e. un traceur lagrangien).
Dans le cadre de l'article, on parle plus d'un *courant lagrangien* ($\vv_L$) comme un courant qui advecte à l'intérieur des équations du mouvement [[eq:wab]].
Le courant lagrangien est définit comme
\begin{equation}
   \vv_L = \vv + \vv_S.
\end{equation}
\nb Autrement dit, les vagues se font advecter, mais la dérive de Stokes non.
Par contre, elle participe à advecter le courant $\vv$, c'est pourquoi est elle est aussi comptée comme une force qui agit avec Coriolis, aussi.

*** Les équations du mouvement WAB

[cite/t/cf:@suzuki2016understanding] divisent l'influence de la dérive de Stokes en 3 effets notoirslp afin de formuler les équations Boussinesq moyennées sur la période des vagues (/wave-averaged Boussinesq equations/) d'où l'acronyme WAB.
Le système d'équations Boussinesq avec vagues le plus fondamental (autrement dit, le plus clair) est celui illustré à l'équation (5) du même article, soit
#+name:eq:wab
\begin{equation}
   \pdv{\vv}{t}
   +\underbrace{\qty( \vv_L\cdot\gradient{})\vv\grande}_{\substack{\text{Advection}\\\text{lagrangienne}}}
   = \underbrace{-\grande\vb{f}\times\vv_L}_{\substack{\text{Force Cori.}\\\text{lagrangienne}}}
   +\vb{b} + \vb{D} - \gradient p
   \underbrace{\grande- u_L^j\gradient{u_S^j},}_{\substack{\text{Cisaillement}\\\text{de Stokes}}}
\end{equation}
où les indices « /j/ » dénotent la sommation d'Einstein.
Ce système d'équation permet de diviser la dynamique en trois comportements. 
Comme mentionné par [cite/a/cf:@suzuki2016understanding] :

+ *L'advection lagrangienne* (/lagrangian advection/) transfert de l'énergie entre le courant moyen et la turbulence.
+ *La force de Coriolis lagrangienne* et la *force de cisaillement de Stokes* (/Stokes shear force/) transfèrent plutôt de l'énergie des vagues vers la circulation sous-jacente ou la turbulence. 

Il est possible de ré-écrire le système d'équations [[eq:wab]] dans une notation plus propice à développer les équations en eau peu profonde [cite/bc:Voir @suzuki2016understanding équation 1], soit
\begin{equation}
   \pdv{\vv}{t}
   +\underbrace{\grande\qty(\curl{\vv}) \times \vv_L}_{\substack{\text{Wave influenced}\\ \text{vertex force}}}
   +\underbrace{\grande f\pt\kvf\times \vv_L}_{\substack{\text{Force de}\\\text{Stokes-Cori.}}}
   = \vb{b} + \vb{D} -\gradient{}\Big( p + \underbrace{\frac{1}{2}\abs{\vv_L}^2}_{\substack{\text{Modif.}\\\text{pression}}}\Big).
\end{equation}

