2023/Fichiers_tex/mega-doc.tex

\section{La dérive de Stokes selon \Citeauthor{suzuki2016understanding}}
\label{sec:org9ccc590}

\nb Comme dans la notation de \textcite{vallis_2006}, le vecteur \(\vv = \qty(u,v,w)\) dénote le courant d'un écoulement 3D, tandis que le vecteur \(\uu = (u,v)\) est en deux dimensionslp.\bigskip

On peut définir une dérive de Stokes (\(\vv_S\)) lorsqu'il y a un fort rapports suffisant d'échelle en dimension et en temps entre les vagues et la circulation.
Comme l'expriment \textcite[voir][pour un résumé]{suzuki2016understanding},\smallskip
\begin{quote}
« \emph{For these equations to be valid, there must be a separation of horizontal and temporal scales between the waves and the circulation, and the steepness of the waves must be limited [McWilliams et al., 2004].
In the coastal zone, strong variations of currents and surf zones may violate these limitations, but in open water they are more easily satisﬁed. »}\bigskip
\end{quote}
ce qui nous permet de \emph{filter} la dynamique des vagues pour étudier la dérive de Stokes comme une propriété émergente de l'effet des vagues. \bigskip

\textcite{suzuki2016understanding}  caractérisent la dérive de Stokes (\(\vv_S\)) comme un courant lagrangien (\emph{wave-ﬁltered Lagrangian velocity}).
Dans le langage courant, un \textbf{quantité lagrangienne} se fait advecter (p.e. un traceur lagrangien).
Dans le cadre de l'article, on parle plus d'un \textbf{courant lagrangien} (\(\vv_L\)) comme un courant qui advecte à l'intérieur des équations du mouvement \ref{eq:org654e38b}.
Le courant lagrangien est définit comme
\begin{equation}
   \vv_L = \vv + \vv_S.
\end{equation}
\nb Autrement dit, les vagues se font advecter, mais la dérive de Stokes non.
Par contre, elle participe à advecter le courant \(\vv\), c'est pourquoi est elle est aussi comptée comme une force qui agit avec Coriolis, aussi.

\subsection{Les équations du mouvement WAB}
\label{sec:orgfb58f95}

\textcite{suzuki2016understanding} divisent l'influence de la dérive de Stokes en 3 effets notoirslp afin de formuler les équations Boussinesq moyennées sur la période des vagues (\emph{wave-averaged Boussinesq equations}) d'où l'acronyme WAB.
Le système d'équations Boussinesq avec vagues le plus fondamental (autrement dit, le plus clair) est celui illustré à l'équation (5) du même article, soit
\begin{equation}
\label{eq:org654e38b}
   \pdv{\vv}{t}
   +\underbrace{\qty( \vv_L\cdot\gradient{})\vv\grande}_{\substack{\text{Advection}\\\text{lagrangienne}}}
   = \underbrace{-\grande\vb{f}\times\vv_L}_{\substack{\text{Force Cori.}\\\text{lagrangienne}}}
   +\vb{b} + \vb{D} - \gradient p
   \underbrace{\grande- u_L^j\gradient{u_S^j},}_{\substack{\text{Cisaillement}\\\text{de Stokes}}}
\end{equation}
où les indices « \emph{j} » dénotent la sommation d'Einstein.
Ce système d'équation permet de diviser la dynamique en trois comportements. 
Comme mentionné par \Citeauthor{suzuki2016understanding} :

\begin{itemize}
\item \textbf{L'advection lagrangienne} (\emph{lagrangian advection}) transfert de l'énergie entre le courant moyen et la turbulence.
\item \textbf{La force de Coriolis lagrangienne} et la \textbf{force de cisaillement de Stokes} (\emph{Stokes shear force}) transfèrent plutôt de l'énergie des vagues vers la circulation sous-jacente ou la turbulence.
\end{itemize}

Il est possible de ré-écrire le système d'équations \ref{eq:org654e38b} dans une notation plus propice à développer les équations en eau peu profonde \autocite[Voir][équation 1]{suzuki2016understanding}, soit
\begin{equation}
   \pdv{\vv}{t}
   +\underbrace{\grande\qty(\curl{\vv}) \times \vv_L}_{\substack{\text{Wave influenced}\\ \text{vertex force}}}
   +\underbrace{\grande f\pt\kvf\times \vv_L}_{\substack{\text{Force de}\\\text{Stokes-Cori.}}}
   = \vb{b} + \vb{D} -\gradient{}\Big( p + \underbrace{\frac{1}{2}\abs{\vv_L}^2}_{\substack{\text{Modif.}\\\text{pression}}}\Big).
\end{equation}
