2023/mega-doc.org
*** Connecter les équations WAB avec le modèle en eau peu profonde

Le modèle en *eau peu profonde* est caractérisé par deux approximations :
+ Dans une couche, la densité volumique de l'eau est constante,
  \begin{equation}
     \rho(x,y,z,t) = \rho_o.   
  \end{equation}

+ On assume que les courants verticaux sont très faibles en comparaison des courant horizontaux,
  \begin{equation}
     w \ll (u,v) \hspace{0.3cm} \Longrightarrow \hspace{0.3cm} \qty(\dv{w}{t}),\pt w^2 \longrightarrow 0.
  \end{equation}
L'équation du courant vertical est réduite à l'expression de la pression hydrostatique ([[eq:hydro-sw]]) -- qu'on intègre verticalement pour obtenir la pression dans la première couche, soit
#+name:eq:hydro-sw
\begin{equation}
   b = \pdv{p}{z} = \rho_o g \hspace{0.3cm}
   \Rightarrow \hspace{0.3cm} \int_{z}^{\eta_1=0} \qty( \pdv{p}{z} = \rho_o g ) \dd z \hspace{0.3cm}
   \Rightarrow \hspace{0.3cm} p(x,y,z) = \rho_o gz + p_s(x,y)
\end{equation}
où la surface fixe (/rigid lid/), nous permet d'imposer la pression de surface $p_s(x,y)\ \forall \ (x,y)$ comme constante d'intégration en $z$ puisque la surface fixe impose $z=\eta_1=0\ \forall\ (x,y)$.
Dans notre couche de surface, le gradient de pression est donc décomposé de manière à obtenir,
\begin{equation}
   \gradient{p} = \underbrace{\qty[\pdv{}{x}\ivf + \pdv{}{y} \jvf]}_{\gradient_h }p_s + \rho_o g \pt\kvf.
\end{equation}
\nb Dans un modèle à plusieurs couches, l'intégration en [[eq:hydro-sw]] donnerait plutôt l'expression générale
\begin{equation}
   p_k(x,y,z) = p_s(x,y) + \qty(\sum_{i=1}^{k-1} \rho_i g h_i) + g\rho_k \tilde{z}
   \hspace{0.6cm} \text{où}\hspace{0.6cm}
   \tilde{z}\equiv z-\qty(\sum_i^{k-1} h_i).
\end{equation}
et le gradient de pression se convertirait en
\begin{equation}
   \gradient{p} = \underbrace{\qty[\ivf\pdv{}{x} + \jvf\qty(\pdv{}{y})]}_{\gradient_h }\qty(p_s + g \sum_i^{k-1} \rho_i h_i(x,y))
   +\rho_k g \pt\kvf,
\end{equation}
où l'indice $k$ dénote la couche en question.\bigskip

L'expression décrivant l'écoulement horizontal du modèle en eau peu profonde est ainsi formulée par
#+name:eq:wasw1
\begin{equation}
   \pdv{\uu}{t}
   \pt + \pt \qty(f+\zeta)\pt \kvf\pt \times \uu
   \pt + \pt \underbrace{\grande\zeta\pt \kvf\pt \times \uu_S}_{\substack{\text{Craik-}\\ \text{Leibovich}}}
   \pt + \pt \underbrace{\grande f\pt \kvf\pt \times \uu_S  }_{\substack{\text{Stokes-}\\ \text{Coriolis}}}
   \pt = \pt -\gradient{B_S}
   \pt + \pt \ \boldsymbol{D}
    \pt \underbrace{+\pt\frac{\boldsymbol{\tau}_o}{\rho H},}_{\substack{\text{Modulation}\\ \text{du vent}}}
\end{equation}
où la nouvelle fonction de Bernouilli prenant compte de la dérive de Stokes ($B_S$) est exprimée par
\begin{align}
   B_S = B + \uu\cdot\qty(\vb{U}_S/H_k) + \qty(\vb{U}_S^2/H_S^2)/2 + \phi_s,
\end{align}
où $\vb{U}_S$ est le transport de Stokes fournit par le modèle de vagues et $\phi_s\equiv p_s/\rho_o$.
L'introduction de $\boldsymbol{\tau}_o$ dans l'équation [[eq:wasw1]] est confirmée par [cite/t/c:@breivik_al_2015], mais nous y reviendrons à la section [[sec:tau]].
\bigskip

À plusieurs couches, les équations horizontales du modèle en eau peu profonde sont exprimées par
#+name: eq:mvmtdev
\begin{equation}
   \pdv{\uu_k}{t}
   \pt + \pt \qty(f+\zeta_k)\pt \kvf\pt \times \uu_k
   \pt + \pt \underbrace{\delta(k,1)\cdot\grande\qty(f + \zeta_1)\pt \kvf\pt \times \uu_S}_{\substack{\text{Stokes-Coriolis}\\ \text{et Craik-Leibovich}}}
   \pt = \pt -\gradient{B_{S,k}}
   \pt + \pt \ \boldsymbol{D}_k
   +\pt \underbrace{\delta(k,1)\cdot\qty(\frac{\boldsymbol{\tau}_o}{\rho_k H_k}),}_{\substack{\text{Modulation du}\\ \text{vent par vagues}}}
\end{equation}
ce qui laisse apparaître deux termes importants, soient Stokes-Coriolis et Craik-Leibovich.
D'autres termes associés à la dérive de Stokes pourraient être implémentés (voir [cite/t/c:@wu_breivik_2019] par exemple) si l'on considère aussi la vorticité associée à la dérive de Stokes dans l'équation [[eq:mvmtdev]], mais ça ne fera pas partie de notre étude.
La fonction de Bernouilli serait exprimée par
\begin{align}
   & B_{S,k} = B_k + \delta(k,1)\cdot\qty(\tall\uu_1\cdot\vb{u}_S + \vb{u}_S^2/2), \\
   & B_k = p_k + \vb{u}_k^2/2.
\end{align}


*** Conservation de la masse

On peut obtenir l'équation de conservation de la masse dans chaque couche en intégrant l'équation d'incompressibilité.
Rapidement,
\begin{align}
   \nonumber&\qty(\div{\vv}) = \qty(\pdv{w}{z}) + \qty(\pdv{u}{x} + \pdv{v}{y}) = 0,\\
   \rhd\hspace{0.5cm}\venti\nonumber & \int_{z_{bot}}^{z_{top}} \qty{\qty(\pdv{w}{z}) + \qty(\pdv{u}{x} + \pdv{v}{y}) = 0}\ \dd z,\\
   \rhd\hspace{0.5cm}\venti\nonumber & \underbrace{\grande w(z_{top}) - w(z_{bot})}_{\sfrac{\partial h_k}{\partial t}} + \int_{z_{bot}}^{z_{top}} \qty(\div{\uu_k}) = 0,\\
   \rhd\hspace{0.5cm}\venti\nonumber & \pdv{h_k}{t} + \div(\int_{z_{bot}}^{z_{top}}\uu_k) = 0,\\
   \rhd\hspace{0.5cm}\venti & \boxed{\ \pdv{h_k}{t} + \div(h_k \uu_k) = 0,\ }
\end{align}
où $z_{top}$ et $z_{bot}$ décrivent respectivement le haut et le bas de la couche d'eau en question.\bigskip

\begin{notabene}
   \nb L'expression
   \begin{equation}
      \int_{z_{bot}}^{z_{top}} \qty(\div{\uu_k}) = \div(\int_{z_{bot}}^{z_{top}}\uu_k) = \div(h_k\uu_k),
   \end{equation}
   est valide pour deux raison : les variables $z$ et $x,y$ sont indépendantes et le courant est homogène dans chaque couches comme approximation dans le modèle en eau peu profonde.
\end{notabene}

  
L'article de [cite/t/c:@wu_breivik_2019] est assez explicite sur l'addition du transport de Stokes à l'intérieur de l'équation de conservation de la masse.\bigskip

\begin{equation}
   \pdv{h_k}{t} =  \divergence(h_k\uu_k)\ +\ \underbrace{\delta\pt(k,1)\cdot \qty(\divergence{\vb{U}_S}).}_{\substack{\text{Transport}\\ \text{de Stokes}}}
\end{equation}

** Contrainte de cisaillement du vent à la surface
<<sec:tau>>

Comme illustré dans l'article de [cite/t/c:@breivik_al_2015], la contrainte de cisaillement du vent à la surface est modifié de 3 manières :
+ La rugosité de la surface est prise en compte à l'aide concept /friction velocity/, ($\tau_{fv} = \rho_a |\uu_*| \uu_*$),
+ Le champ de vague vient prendre du momentum au vent ($\tau_{IN}$),
+ Le champ de vagues libère une partie de son énergie à la circulation sous-jacente ($\tau_{DS}$).

On passe donc d'un stress atmosphérique fixe à un stress dépendant du champ de vagues, de sorte que l'on passe de 
\begin{align}
   && \boldsymbol{\tau}_a = \rho_a\pt c_D \abs{\uu_{10}}\uu_{10} && \Longrightarrow && \boldsymbol{\tau}_{oc} = \boldsymbol{\tau}_{fv} - (\boldsymbol{\tau}_{IN} - \boldsymbol{\tau}_{DS}). &&
\end{align}

À l'aide d'une /switch/ de couplage $\delta_{COU}$, la contrainte de cisaillement à la surface est donc exprimée par
\begin{equation}
   \boldsymbol{\tau}\ =\ \underbrace{\tall\delta_{COU}\cdot\boldsymbol{\tau}_{oc}}_\text{Couplé}\ + \ \underbrace{(1-\delta_{COU}) \cdot \boldsymbol{\tau}_a\tall}_\text{Non-couplé}.
\end{equation}
\nb De plus amples informations sur le stress et le vent se retrouvent aux sections [[sec:vent]] et [[sec:inputww3]].
  
