2023/mega-doc.org
** Champs échangés par les deux modèles

Le modèle /shallow water/ envoie une seule quantité au modèle de vagues, soit
+ Le *courant de la première couche* $(u_1,v_1)$.\bigskip

Le modèle Wavewatch III envoie 4 quantités au modèle /shallow water/, soit
+ Le *transport de Stokes* $\vb{U}_S$;
+ La *friction velocity* (vitesse de friction) $\vb{\uu}_*$;
+ Le *momentum absorbé par le champ de vagues* $\boldsymbol{\tau}_{IN}$;
+ Le *momentum dispersé par le champ de vagues* à la circulation sous-jacente $\boldsymbol{\tau}_{IN}$;\bigskip

Wavewatch pourrait aussi nous offrir plusieurs quantités intéressantes pous le couplage, j'en ai compilé une bonne partie dans le tableau [[tab:output]] avec les informations retrouvées dans la documentation de Wavewatch, son code et la littérature adjacente.
Comme il y a eu beaucoup d'incertitude quand à la nature des quantités, mentionnons que tous les $\tau$ fournit par Wavewatch III sont divisé par $\rho_{Atm}$.
C'est mentionné explicitement dans la sous-routine du modèle /w3src3md.ftn/, mais pas dans la documentation.

#+NAME: tab:output
#+CAPTION: Tableau d'investigation récapitulatif des outputs de Wavewatch III.
#+attr_latex: :align lll|lc|c
|---------------+------------+--------------------------------------------+-------------+-------------+--------------------------|
|---------------+------------+--------------------------------------------+-------------+-------------+--------------------------|
| *Documentation* | *de WW3*     | (Voir /ww3 shel.inp/)                        | *Code de WW3* |             | *Litérature*               |
|---------------+------------+--------------------------------------------+-------------+-------------+--------------------------|
| Nom de code   | Output tag | Description                                | Variable    | Unitées     | Symbole                  |
|---------------+------------+--------------------------------------------+-------------+-------------+--------------------------|
| UST           | UST        | /Friction velocity/                          | UST         | ms^{-1}     | $\ust$                   |
| CHARN         | CHA        | /Charnok parameter/                          | CHARN       | --          | \alpha                   |
| CGE           | CGE        | /Energy flux/                                | CGE         | Wm^{-2}     | $C_gE$                   |
| PHIAW         | FAW        | /Air-sea energy flux/                        | PHIAW       | Wm^{-2}     | ?                        |
| TAUWI[X,Y]    | TAW        | /Net wave-supported stress/                  | TAUWIX/Y    | m^{2}s^{-2} | $\tau_w$  ou $\tau_{IN}$ |
| TAUWN[X,Y]    | TWA        | /Negative part of wave-supported stress/ | TAUWNX/Y    | m^{2}s^{-2} | $\tau_w<0$               |
|---------------+------------+--------------------------------------------+-------------+-------------+--------------------------|
| TAUO[X,Y]     | TWO        | /Wave to ocean momentum flux/                | TAUOX/Y     | m^{2}s^{-2} | $\tau_{DS}$              |
| PHIOC         | FOC        | /Wave to ocean energy flux/                  | PHIOC       | Wm^{-2}     | ?                        |
| TUS[X,Y]      | TUS        | /Stokes transport/                           | TUSX/Y      | m^{2}s^{-1} | $\vb{U}_S$               |
| USS[X,Y]      | USS        | /Surface Stokes drift/                       | USSX/Y      | m s^{-1}    | $\uu_S$                  |
|---------------+------------+--------------------------------------------+-------------+-------------+--------------------------|
|---------------+------------+--------------------------------------------+-------------+-------------+--------------------------|



* Techniques numériques en lien avec le couplage

#+NAME: fig:interp
#+caption: Mise en relation des grilles du modèle «shallow water» (haute résolution, indicateurs bleus) et Wavewatch III (basse résolution, indicateurs noirs). En a) et b) « Stencil » utilisé pour réaliser l'interpolation géométrique à ratio $R$ impair.
\begin{wrapfigure}[28]{r}{0.45\textwidth}
\vspace{-2\baselineskip}
\begin{center}
%
\begin{tikzpicture}[scale = 0.8]
\draw (-0.8,6.0) node {a)};
\draw (6.5,0) node {};
% Big grid
\fill [blue!5] (0,0) rectangle (3,3);
\fill [blue!5] (3,3) rectangle (6,6);
% Grid
\draw (0,0) rectangle (6,6) ;
\draw [dotted] (0,0) grid (6,6) ;
\draw [step=3.0] (0,0) grid (6,6) ;
% Carré
\fill [cyan, opacity=0.1] (2,2) rectangle (5,5) ;
\draw [cyan, thick] (2,2) rectangle (5,5) ;
\fill [cyan!50, opacity=0.5] (3,3) rectangle (4,4);
% Coordinates 
\foreach \x in {1,2,3}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {1,1};}
%
\foreach \x in {4,5,6}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {2,1};}
%
\foreach \x in {1,2,3}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {1,2};}
%
\foreach \x in {4,5,6}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {2,2};}
% Axis:
\foreach \y in {1,2,3,4,5,6} {\draw (-0.5,\y-0.5) node [cyan] {\y};}
\foreach \x in {1,2,3,4,5,6} {\draw (\x-0.5,-0.5) node [cyan] {\x};}
%
\end{tikzpicture}
%
\begin{tikzpicture}[scale = 0.8]
\draw (-0.8,6.0) node {b)};
\draw (6.5,0) node {};
% Big grid
\fill [blue!5] (0,0) rectangle (3,3);
\fill [blue!5] (3,3) rectangle (6,6);
% Grid
\draw (0,0) rectangle (6,6) ;
\draw [dotted] (0,0) grid (6,6) ;
\draw [step=3.0] (0,0) grid (6,6) ;
% Carré
\fill [cyan, opacity=0.1] (0,1) rectangle (2,4) ;
\draw [cyan, thick] (0,1) rectangle (2,4) ;
\fill [cyan!50, opacity=0.5] (0,2) rectangle (1,3);
% Coordinates 
\foreach \x in {1,2,3}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {1,1};}
%
\foreach \x in {4,5,6}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {2,1};}
%
\foreach \x in {1,2,3}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {1,2};}
%
\foreach \x in {4,5,6}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {2,2};}
% Axis:
\foreach \y in {1,2,3,4,5,6} {\draw (-0.5,\y-0.5) node [cyan] {\y};}
\foreach \x in {1,2,3,4,5,6} {\draw (\x-0.5,-0.5) node [cyan] {\x};}
%
\end{tikzpicture}
%
\end{center}
\end{wrapfigure}

** Interpolation géométrique

*** Du modèle « shallow water » au modèle Wavewatch

Le modèle Wavewatch III roule sur une grille *trois fois plus petite* que celle du modèle /shallow water/, entre autres pour sauver du temps de computation.
Donc, lorsqu'on envoie le champ de courant $(u_1,v_1)$ à Wavewatch III, on fait avant tout une moyenne de $R^2$ points où $R$ est le ratio des deux grilles (3 dans notre cas).
$R^2$ représente aussi la taille du /stencil/.\bigskip

Mathématiquement, ça se traduit par
#+NAME: eq:moyenne
\begin{equation}
   (u^{\pt i,j},\pt v^{\pt i,j}) =
   \sum_{\substack{k=1 + (i-1)\times R\\ l=1 + (j-1)\times R}}^{i\times R,\pt j\times R}
   (u_{\pt k,\pt l},\pt v_{\pt k,\pt l}),
\end{equation}

mais ça revient juste à faire la moyenne dans un carré de R^2 = 3\times 3, comme on passe de la grosse grille à la petite grille (comme on peut le voir à la figure [[fig:interp]]a). \bigskip

\nb L'indice en exposant réfère à la grille de résolution plus faible (donc celle qui sera envoyée à Wavewatch III) et l'indice au pied réfère à la grille à haute résolution, soit celle du modèle /shallow water/.

