2023/Fichiers_tex/mega-doc.tex

\section{Champs échangés par les deux modèles}
\label{sec:org80cb7d5}

Le modèle \emph{shallow water} envoie une seule quantité au modèle de vagues, soit
\begin{itemize}
\item Le \textbf{courant de la première couche} \((u_1,v_1)\).\bigskip
\end{itemize}

Le modèle Wavewatch III envoie 4 quantités au modèle \emph{shallow water}, soit
\begin{itemize}
\item Le \textbf{transport de Stokes} \(\vb{U}_S\);
\item La \textbf{friction velocity} (vitesse de friction) \(\vb{\uu}_*\);
\item Le \textbf{momentum absorbé par le champ de vagues} \(\boldsymbol{\tau}_{IN}\);
\item Le \textbf{momentum dispersé par le champ de vagues} à la circulation sous-jacente \(\boldsymbol{\tau}_{IN}\);\bigskip
\end{itemize}

Wavewatch pourrait aussi nous offrir plusieurs quantités intéressantes pous le couplage, j'en ai compilé une bonne partie dans le tableau \ref{tab:orga46f647} avec les informations retrouvées dans la documentation de Wavewatch, son code et la littérature adjacente.
Comme il y a eu beaucoup d'incertitude quand à la nature des quantités, mentionnons que tous les \(\tau\) fournit par Wavewatch III sont divisé par \(\rho_{Atm}\).
C'est mentionné explicitement dans la sous-routine du modèle \emph{w3src3md.ftn}, mais pas dans la documentation.

\begin{table}[htbp]
\caption{\label{tab:orga46f647}Tableau d'investigation récapitulatif des outputs de Wavewatch III.}
\centering
\begin{tabular}{lll|lc|c}
\hline
\hline
\textbf{Documentation} & \textbf{de WW3} & (Voir \emph{ww3 shel.inp}) & \textbf{Code de WW3} &  & \textbf{Litérature}\\[0pt]
\hline
Nom de code & Output tag & Description & Variable & Unitées & Symbole\\[0pt]
\hline
UST & UST & \emph{Friction velocity} & UST & ms\textsuperscript{-1} & \(\ust\)\\[0pt]
CHARN & CHA & \emph{Charnok parameter} & CHARN & -- & \(\alpha\)\\[0pt]
CGE & CGE & \emph{Energy flux} & CGE & Wm\textsuperscript{-2} & \(C_gE\)\\[0pt]
PHIAW & FAW & \emph{Air-sea energy flux} & PHIAW & Wm\textsuperscript{-2} & ?\\[0pt]
TAUWI[X,Y] & TAW & \emph{Net wave-supported stress} & TAUWIX/Y & m\textsuperscript{2}s\textsuperscript{-2} & \(\tau_w\)  ou \(\tau_{IN}\)\\[0pt]
TAUWN[X,Y] & TWA & \emph{Negative part of wave-supported stress} & TAUWNX/Y & m\textsuperscript{2}s\textsuperscript{-2} & \(\tau_w<0\)\\[0pt]
\hline
TAUO[X,Y] & TWO & \emph{Wave to ocean momentum flux} & TAUOX/Y & m\textsuperscript{2}s\textsuperscript{-2} & \(\tau_{DS}\)\\[0pt]
PHIOC & FOC & \emph{Wave to ocean energy flux} & PHIOC & Wm\textsuperscript{-2} & ?\\[0pt]
TUS[X,Y] & TUS & \emph{Stokes transport} & TUSX/Y & m\textsuperscript{2}s\textsuperscript{-1} & \(\vb{U}_S\)\\[0pt]
USS[X,Y] & USS & \emph{Surface Stokes drift} & USSX/Y & m s\textsuperscript{-1} & \(\uu_S\)\\[0pt]
\hline
\hline
\end{tabular}
\end{table}



\chapter{Techniques numériques en lien avec le couplage}
\label{sec:orga3edb46}

\section{Interpolation géométrique}
\label{sec:org0153b14}
\begin{wrapfigure}[41]{r}{0.45\textwidth}
\vspace{-5\baselineskip}
\begin{center}
\begin{tikzpicture}[scale = 0.9]
\draw (-0.5,6.3) node {a)};
\draw (6.5,0) node {};
% Big grid
\fill [blue!5] (0,0) rectangle (3,3);
\fill [blue!5] (3,3) rectangle (6,6);
% Grid
\draw (0,0) rectangle (6,6) ;
\draw [dotted] (0,0) grid (6,6) ;
\draw [step=3.0] (0,0) grid (6,6) ;
% Coordinates 
\foreach \x in {1,2,3}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {1,1};}
%
\foreach \x in {4,5,6}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {2,1};}
%
\foreach \x in {1,2,3}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {1,2};}
%
\foreach \x in {4,5,6}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {2,2};}
% Axis:
\foreach \y in {1,2,3,4,5,6} {\draw (-0.5,\y-0.5) node [cyan] {\y};}
\foreach \x in {1,2,3,4,5,6} {\draw (\x-0.5,-0.5) node [cyan] {\x};}
%
\end{tikzpicture}
%
\begin{tikzpicture}[scale = 0.9]
\draw (-0.5,6.3) node {b)};
\draw (6.5,0) node {};
% Big grid
\fill [blue!5] (0,0) rectangle (3,3);
\fill [blue!5] (3,3) rectangle (6,6);
% Grid
\draw (0,0) rectangle (6,6) ;
\draw [dotted] (0,0) grid (6,6) ;
\draw [step=3.0] (0,0) grid (6,6) ;
% Carré
\fill [cyan, opacity=0.1] (2,2) rectangle (5,5) ;
\draw [cyan, thick] (2,2) rectangle (5,5) ;
\fill [cyan!50, opacity=0.5] (3,3) rectangle (4,4);
% Coordinates 
\foreach \x in {1,2,3}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {1,1};}
%
\foreach \x in {4,5,6}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {2,1};}
%
\foreach \x in {1,2,3}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {1,2};}
%
\foreach \x in {4,5,6}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {2,2};}
% Axis:
\foreach \y in {1,2,3,4,5,6} {\draw (-0.5,\y-0.5) node [cyan] {\y};}
\foreach \x in {1,2,3,4,5,6} {\draw (\x-0.5,-0.5) node [cyan] {\x};}
%
\end{tikzpicture}
%
\begin{tikzpicture}[scale = 0.9]
\draw (-0.5,6.3) node {c)};
\draw (6.5,0) node {};
% Big grid
\fill [blue!5] (0,0) rectangle (3,3);
\fill [blue!5] (3,3) rectangle (6,6);
% Grid
\draw (0,0) rectangle (6,6) ;
\draw [dotted] (0,0) grid (6,6) ;
\draw [step=3.0] (0,0) grid (6,6) ;
% Carré
\fill [cyan, opacity=0.1] (0,1) rectangle (2,4) ;
\draw [cyan, thick] (0,1) rectangle (2,4) ;
\fill [cyan!50, opacity=0.5] (0,2) rectangle (1,3);
% Coordinates 
\foreach \x in {1,2,3}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {1,1};}
%
\foreach \x in {4,5,6}
\foreach \y in {1,2,3}
{\draw (\x-0.5,\y-0.5) node [] {2,1};}
%
\foreach \x in {1,2,3}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {1,2};}
%
\foreach \x in {4,5,6}
\foreach \y in {4,5,6}
{\draw (\x-0.5,\y-0.5) node [] {2,2};}
pn% Axis:
\foreach \y in {1,2,3,4,5,6} {\draw (-0.5,\y-0.5) node [cyan] {\y};}
\foreach \x in {1,2,3,4,5,6} {\draw (\x-0.5,-0.5) node [cyan] {\x};}
%
\end{tikzpicture}
%
\end{center}
\caption{\label{org154c50d}En a), mise en relation de la grille du modèle «shallow water» (haute résolution, indicateurs bleus) par rapport à la grille de Wavewatch III (basse résolution, indicateurs noirs). En b) et c) « Stencil » utilisé pour réaliser l'interpolation géométrique à ratio \(R\) impair.}
\end{wrapfigure}

\subsection{Du modèle « shallow water » au modèle Wavewatch}
\label{sec:orga94123a}

Le modèle Wavewatch III roule sur une grille \textbf{trois fois plus petite} que celle du modèle \emph{shallow water}, entre autres pour sauver du temps de computation.
Donc, lorsqu'on envoie le champ de courant \((u_1,v_1)\) à Wavewatch III, on fait avant tout une moyenne de \(R^2\) points où \(R\) est le ratio des deux grilles (3 dans notre cas).
\(R^2\) représente aussi la taille du \emph{stencil}.\bigskip

Mathématiquement, ça se traduit par
\begin{equation}
\label{eq:org341a5f3}
   (u^{\pt i,j},\pt v^{\pt i,j}) =
   \sum_{\substack{k=1 + (i-1)\times R\\ l=1 + (j-1)\times R}}^{i\times R,\pt j\times R}
   (u_{\pt k,\pt l},\pt v_{\pt k,\pt l}),
\end{equation}

mais ça revient juste à faire la moyenne dans un carré de R\textsuperscript{2} = 3\texttimes{} 3, comme on passe de la grosse grille à la petite grille (comme on peut le voir à la figure \ref{org154c50d}a). \bigskip

\nb L'indice en exposant réfère à la grille de résolution plus faible (donc celle qui sera envoyée à Wavewatch III) et l'indice au pied réfère à la grille à haute résolution, soit celle du modèle \emph{shallow water}.
