2023/mega-doc.org
*** De Wavewatch au modèle « shallow water »

À l'inverse, lorsqu'on reçoit les champs de Wavewatch III,  on utilise un /stencil/ de taille $R^2$ qui fait la moyenne géométrique des points adjacents (comme illustré à la figure [[fig:interp]]a).
Par exemple, pour le modèle /shallow water/, la quantité au point (4,4) $Q^{\pt4,4}$ est calculée à l'aide d'une moyenne pondérée des points de Wavewatch, soit
\begin{equation}
   {\color{MidnightBlue} Q_{\pt4,4}} = \qty[\ 1\times Q^{\pt1,1}+ 2\times Q^{\pt1,2}+ 2\times Q^{\pt2,1}+ 4\times Q^{\pt2,2}\ ]\pt/\pt9
\end{equation}

où le tout est divisé par $R^2 = 9$ (voir figure [[fig:interp]]a).\bigskip

À la frontière, on réduit la taille du /stencil/ de sorte à s'adapter à la forme du mur (voir figure [[fig:interp]]b).
Par exemple, pour le modèle /shallow water/, le point (1,3) est calculé à l'aide de la moyenne pondéré des points de Wavewatch, soit
#+NAME: eq:geom1
\begin{equation}
   {\color{MidnightBlue} Q_{\pt1,3}} = \qty[\ 2\times Q^{\pt1,2} + 4\times Q^{\pt1,1}\ ]\pt/\pt6
\end{equation}
où le tout divisé par 2\times3 = 6, soit la taille du /stencil/ (voir figure [[fig:interp]]b).

*** Interpolation grille C et grille A

Le modèle Wavewatch III est déployé sur une grille A, tandis que le modèle /shallow water/ est construit sur une grille de type Arakawa-C, ce qui vient avec son lot de problème.\bigskip

Une fois l'interpolation géométrique exécutée, il est important de replacer les quantités sur la bonne grille.
C'est pourquoi nous interpolons la valeur des champs.
Par exemple, avant d'être moyenné puis envoyé à Wavewatch, le courant de surface du modèle /shallow water/ $u$ doit être interpolé de sorte à ce que
#+NAME: eq:geom2
\begin{equation}
   u^{\pt A}_{\pt i,j} = \qty[\ u^{\pt C}_{\pt i,j} + u^{\pt C}_{\pt i-1,j}\ ]\pt/\pt2,
\end{equation}
où l'exposant $A$ réfère triviallement à la grille de type A et l'indice $C$ réfère à la grille de type C.\bigskip

On effectue l'étape inverse lorsqu'on reçoit les champs de Wavewatch III.

** Cheminement des étapes de couplage et d'interpolation

Avant de réaliser l'échange des champs par canal MPI, l'ordre des étapes est le suivant :
1. Le modèle /shallow water/ interpole les champs de courant de la première couche $(u_1,v_1)$ sur une grille A :
   \begin{equation}
      (\pt u_1^{\pt C},v_1^{\pt C}\pt) \hspace{0.3cm}\longmapsto \hspace{0.3cm} (\pt u_1^{\pt A},v_1^{\pt A}\pt),
   \end{equation}
2. Le modèle /shallow water/ fait un moyennage des cases pour atteindre la résolution réduite de Wavewatch III (voir équation [[eq:moyenne]]). 
3. On envoit le courant à faible résolution sur une grille A à Wavewatch III par un canal MPI.
4. On reçoit les quantités de Wavewatch à basse résolution par le canal MPI.
5. On réalise l'interpolation géométrique sur les quantités pour avoir une meilleure résolution (voir équation [[eq:geom1]] et [[eq:geom2]]).
6. On fait une interpolation pour passer d'une grille Arakawa-A vers une grille Arakawa-C, de sorte que
   \begin{equation}\qty{\
      \begin{matrix}
        \qty(\tau_{x,IN}^{\pt A},\tau_{y,IN}^{\pt A}\pt), &
        \qty(\tau_{x,DS}^{\pt A},\tau_{y,DS}^{\pt A}\pt), \\
        \qty(u_*^{\pt A},v_*^{\pt A}),   &
        \qty(U_S^{\pt A},V_S^{\pt A})
      \end{matrix}}
      \hspace{0.3cm}\longmapsto \hspace{0.3cm}\qty{\
      \begin{matrix}
        \qty(\tau_{x,IN}^{\pt C},\tau_{y,IN}^{\pt C}\pt), &
        \qty(\tau_{x,DS}^{\pt C},\tau_{y,DS}^{\pt C}\pt), \\
        \qty(u_*^{\pt C},v_*^{\pt C}),   &
        \qty(U_S^{\pt C},V_S^{\pt C})
      \end{matrix}}
      \end{equation}
   et le tour est joué...\bigskip

Les deux modèles enchaînent ensuite sur leur /timestepping/ et leur propre /RHS/.

** Rampe au moment du couplage

#+NAME: fig:ramp
#+CAPTION: Illustration conceptuelle de la rampe pour éviter le /spin up/ du modèle de vagues.
\begin{figure}
\begin{center}
\begin{tikzpicture}[scale=1.4]
   % Rectangles :
   \fill [BurntOrange!10] (0,0) rectangle (2,3) ;
   \fill [BurntOrange!18] (2,0) rectangle (4,3) ;
   \fill [BurntOrange!26] (4,0) rectangle (6,3) ;
   %
   \draw (1,2.75) node [] {Spin up};
   \draw (3,2.75) node [] {Rampe};
   \draw (5,2.75) node [] {Couplé};
   %
   \draw [thick, MidnightBlue] (2,3) -- (2,0);
   %
   \draw [->] (0,0) -- (6.25,0);
   \draw [->] (0,0) -- (0,3.25);
   \draw [dotted] (0,2.5) -- (6,2.5);
   \draw [thick, BurntOrange!50!red!90] (0,0.01) -- (2,0.01) -- (4,2.5) -- (6,2.5);
   \draw [thick, red] (0,2.5) -- (2,2.5) -- (4,0.01) -- (6,0.01);
   \draw (0,2.5) node [left] {1};
   \draw (0,0) node [left] {0};
   \draw (0,1.30) node [rotate=90, above] {Rampe};
   \draw (2,0) node [below, MidnightBlue] {Couplage};
   \draw (4,0) node [below] {1 mois};
   \draw (6,0) node [below] {Temps};
   %
   \draw (5.7,0.2) node [red] {$\boldsymbol{\tau_{atm}}$};
   \draw (5.7,2.3) node [BurntOrange!50!red!90] {$\boldsymbol{\tau_{oc}}$};
   \draw (5.6,2.1) node [BurntOrange!50!red!90] {$\vb{U}_{Stokes}$};
\end{tikzpicture}
\end{center}
\end{figure}

Comme le modèle Wavewatch a un /spin up/ assez *brutal*, on se permet de mettre une rampe de couplage étallée sur 1 mois (31 jours).
D'un côté, ça permet de limiter la réponse du modèle /shallow water/ à un changement brusque de régime.
De l'autre, ça donne un peu de temps au modèle de vagues pour se stabiliser.
Après toutes expériences que j'ai réalisées, je peux dire que le modèle de vagues prend un bon 4 jours avant de se stabiliser complétement

* Paramètres physiques des équations

** Stress du vent appliqué à la surface des deux modèles
<<sec:vent>>
Stress du vent appliqué à la surface est donné par
#+name:cisaillementvent
\begin{equation}
   \boldsymbol{\tau}_{atm} = \ivf\pt\qty(\venti\frac{\tau_0}{2})\cdot\underbrace{\qty(\venti1-\cos(\frac{2\pi\cdot y}{L_y}))\venti}_\text{Variation y} \pt\cdot\pt \underbrace{\venti\qty(1+S\cdot\sin(f\cdot t))}_\text{Variation temps},
\end{equation}
où $f$ est une fréquence en [rad s^{-1}] -- soit la fréquence de Coriolis dans notre cas.\bigskip

\nb L'équation précédente est observable dans la sous-routine /model/subs/rhs.f90/.

|   <c>    | <l>            | <l>           | <l>                                     |
| Variable | Valeur         | Unités        | Description                             |
|----------+----------------+---------------+-----------------------------------------|
|  \tau_0  | 0.1            | N\pt m^{-2}   | Valeur maximale du stress atmosphérique |
|    y     | [0, L_x]       | m             | Déplacement latitudinal                 |
|   L_y    | 2\times10^6    | m             | Longueur du domaine                     |
|    f     | 7\times10^{-7} | rad\pt s^{-1} | Fréquence de Coriolis                   |
|    t     | --             | s             | Temps                                   |

