2023/mega-doc.org
** Vent donné en input de Wavewatch III
<<sec:inputww3>>
Comme données entrantes,  Wavewatch ne prend pas le stress atmosphérique $\boldsymbol{\tau}_{atm}$, car il le calcule à l'interne.
Il prend plutôt le vecteur vent à $z=10$ m de la surface de l'eau ($\vb{u}_{10}$).
En premier lieu, pour transformer notre contrainte de cisaillement [[cisaillementvent]], on connait la relation
\begin{equation}
   \tau_a = \rho_a c_D |\uu_{10}| \uu_{10},
\end{equation}
où \rho_a est la densité de l'air et c_D est le coefficient de trainée au dessus de l'océan.
Si l'on assume la valeur de la contrainte de cisaillement (0.1 N m^{-2} dans notre cas), alors on peu facilement trouver le vent à 10m d'altitude $\vb{u}_{10}$.\bigskip

On commence par obtenir la valeur de $c_D$ à l'aide de la relation de Charnok [cite:@charnock1955wind] aussi tirée de [cite/t/c:@gill-atmosphere-ocean p.30],
#+name:cd
\begin{align}
   &&c_D = \qty[\frac{\kappa}{\ln(z/z_{\pt0})}]^2_{\ z=10\pt m}
   && \text{où} &&
   z_0 = \frac{\alpha_{Ch}\tau_a}{\rho_a g} = \frac{\alpha_{Ch} c_D |u_{10}|^2}{g}. &&
\end{align}
Puis enfin, on retrouve $\vb{u}_{10}$ à l'aide de \rho_a et c_D,
\begin{equation}
   u_{10} = \sqrt{\frac{\tau_a}{\rho_a c_D}}.
\end{equation}

\nb Toutes ces équations se retrouvent dans la fonction python /build winds.py/ qui construit un fichier de type NetCDF déchiffrable par /Wavewatch III/.
|     <c>     | <l>          | <l>       | <l>                                            |
|  Variable   | Valeur       | Unités    | Description                                    |
|-------------+--------------+-----------+------------------------------------------------|
|     c_D     | À déterminer | --        | Coefficient de traînée                         |
|   \kappa    | 0.41         | --        | Constante de Von Karman                        |
|      z      | 10           | m         | Hauteur de la mesure du vent (Typiquement 10m) |
|     z_0     | À déterminer | m         | Rugosité de l'interface (/roughness lenght/)     |
| \alpha_{Ch} | 0.0185       | --        | Valeur minimale du paramètre de Charnock       |
|   \tau_a    | [0, 0.1]     | N m^{-2}  | Stress atmosphérique                           |
|      g      | 9.81         | m s^{-2}  | Accélération gravitationnelle                  |
|   \rho_a    | 1.225        | Kg m^{-3} | Densité atmosphérique                          |

**  Le paramètre de Charnock (désambiguation)
Comme illustré dans le tableau précédent, nous avons utilisé 0.0185 comme valeur du paramètre de Charnock.
Le paramètre de Charnock est une quantité adimensionnelle qui dépend de l'état du champ de vagues et qui est curieusement corrélé à l'age du champ de vagues [cite:@janssen2004interaction p.60].
On le calcule à l'aide de la relation
\begin{equation}
   \alpha_c = \frac{z_0 g}{u_*^2}.
\end{equation}
Comme mentionné dans [cite/t/c:@janssen2004interaction], sa valeur est très ambigüe -- [[https://codes.ecmwf.int/grib/param-db/148][le modèle de vagues de l'ECWAM]] utilise une valeur de 0.0185 mais [[https://glossary.ametsoc.org/wiki/Charnock%27s_relation#:~:text=An%20empirical%20expression%20for%20aerodynamic,due%20to%20increasing%20surface%20stress.][l'American Meteorological Society]] propose plutôt une valeur de 0.015.\bigskip

Donc, si l'on ne connait pas vraiment l'état des vagues, on ne peut pas vraiment estimer le coefficient de trainée de l'équation [[cd]] sans le coefficient de Charnock.
Par contre, le [[https://codes.ecmwf.int/grib/param-db/148][site du modèle ECWAM]] mentionne ceci :

#+begin_quote
/This parameter accounts for increased aerodynamic roughness as wave heights grow due to increasing surface stress. It depends on the wind speed, wave age and other aspects of the sea state and is used to calculate how much the waves slow down the wind./

/When the atmospheric model is run without the ocean model, this parameter has a constant value of 0.018. When the atmospheric model is coupled to the ocean model, this parameter is calculated by the ECMWF Wave Model./
#+end_quote

et l'article de [cite/t/c:@janssen2004interaction p.163] mentionnne

#+begin_quote
/The constant $\hat{\alpha}$ was chosen in such a way
that for old windsea the Charnock parameter [$\alpha_{ch}$] has the value of 0.0185 in
agreement with observations collected by Wu (1982) on the drag over sea
waves./
#+end_quote

Donc, c'est pourquoi j'ai pris la valeur de 0.0185 pour calculer le vent à 10 mètre de la surface, à l'aide des relations de la sous-section [[sec:inputww3]].

** Ce que Wavewatch III voit en input

Comme la /switch/ ST3 est activée, le modèle utilise le module /wavewatch/ftn/w3src3md.ftn/ et donc il calcule la /friction velocity/ à l'aide de la sous-routine /CALC USTAR(WINDSPEED,TAUW,USTAR,Z0,CHARN)/.
Plus précisément,
1. Il calcule la partie du *transfert de momentum vers les vagues* $\tau_w$ (/wave supported stress/) à *l'aide de tables* (voir sous-routine /w3sin3/ dans /wavewatch/ftn/w3src3md.ftn/).
2. Il *se sert de nouveau de tables* pour trouver la *vitesse de friction* $u_*$ (/friction velocity)/ en fonction du transfert de momentum aux vagues $\tau_w$ ou $\tau_{IN}$;
3. Il calcule le *coefficient de trainée* $c_D$ à l'aide de la relation
   \begin{equation}
      c_d = \qty(\venti\frac{u_*}{u_{10}})^2;
   \end{equation}
4. Il calcule la *rugosité* $z_0$ (/roughness lenght/) à l'aide de
   \begin{equation}
      z_0 = 10 \exp \qty(-\kappa \sqrt{c_D});
   \end{equation}
5. Il trouve le *paramètre de Charnok* $\alpha_{ch}$ và l'aide de 
   \begin{equation}
      \alpha_{ch} = \frac{z_0 g}{u_*^2}.
   \end{equation}



