2023/Fichiers_tex/mega-doc.tex

\section{Vent donné en input de Wavewatch III}
\label{sec:org009dbd0}
\label{orgffa9632}
Comme données entrantes,  Wavewatch ne prend pas le stress atmosphérique \(\boldsymbol{\tau}_{atm}\), car il le calcule à l'interne.
Il prend plutôt le vecteur vent à \(z=10\) m de la surface de l'eau (\(\vb{u}_{10}\)).
En premier lieu, pour transformer notre contrainte de cisaillement \ref{eq:org36eef4b}, on connait la relation
\begin{equation}
   \tau_a = \rho_a c_D |\uu_{10}| \uu_{10},
\end{equation}
où \(\rho\)\textsubscript{a} est la densité de l'air et c\textsubscript{D} est le coefficient de trainée au dessus de l'océan.
Si l'on assume la valeur de la contrainte de cisaillement (0.1 N m\textsuperscript{-2} dans notre cas), alors on peu facilement trouver le vent à 10m d'altitude \(\vb{u}_{10}\).\bigskip

On commence par obtenir la valeur de \(c_D\) à l'aide de la relation de Charnok \autocite{charnock1955wind} aussi tirée de \Textcite[p.30]{gill-atmosphere-ocean},
\begin{align}
\label{eq:orgf49269f}
   &&c_D = \qty[\frac{\kappa}{\ln(z/z_{\pt0})}]_{\ z=10\pt m}
   && \text{où} &&
   z_0 = \frac{\gamma_{Ch}\tau_a}{g}. &&
\end{align}
Puis enfin, on retrouve \(\vb{u}_{10}\) à l'aide de \(\rho\)\textsubscript{a} et c\textsubscript{D},
\begin{equation}
   u_{10} = \sqrt{\frac{\tau_a}{\rho_a c_D}}.
\end{equation}

\nb Toutes ces équations se retrouvent dans la fonction python \emph{build winds.py} qui construit un fichier de type NetCDF déchiffrable par \emph{Wavewatch III}.
\begin{center}
\begin{tabular}{clll}
Variable & Valeur & Unités & Description\\[0pt]
\hline
c\textsubscript{D} & À déterminer & -- & Coefficient de traînée\\[0pt]
\(\kappa\) & 0.41 & -- & Constante de Von Karman\\[0pt]
z & 10 & m & Hauteur de la mesure du vent (Typiquement 10m)\\[0pt]
z\textsubscript{0} & À déterminer & m & Rugosité de l'interface (\emph{roughness lenght})\\[0pt]
\(\gamma\)\textsubscript{Ch} & 0.0185 & -- & Valeur minimale du paramètre de Charnock\\[0pt]
\(\tau\)\textsubscript{a} & [0, 0.1] & N m\textsuperscript{-2} & Stress atmosphérique\\[0pt]
g & 9.81 & m s\textsuperscript{-2} & Accélération gravitationnelle\\[0pt]
\(\rho\)\textsubscript{a} & 1.225 & Kg m\textsuperscript{-3} & Densité atmosphérique\\[0pt]
\end{tabular}
\end{center}

\section{Le paramètre de Charnock (désambiguation)}
\label{sec:orgf825c0e}
Comme illustré dans le tableau précédent, nous avons utilisé 0.0185 comme valeur du paramètre de Charnock.
Le paramètre de Charnock est une quantité adimensionnelle qui dépend de l'état du champ de vagues et qui est curieusement corrélé à l'age du champ de vagues \autocite[p.60]{janssen2004interaction}.
On le calcule à l'aide de la relation
\begin{equation}
   \alpha_c = \frac{z_0 g}{u_*^2}.
\end{equation}
Comme mentionné dans \Textcite{janssen2004interaction}, sa valeur est très ambigüe -- \href{https://codes.ecmwf.int/grib/param-db/148}{le modèle de vagues de l'ECWAM} utilise une valeur de 0.0185 mais \href{https://glossary.ametsoc.org/wiki/Charnock\%27s\_relation\#:\~:text=An\%20empirical\%20expression\%20for\%20aerodynamic,due\%20to\%20increasing\%20surface\%20stress.}{l'American Meteorological Society} propose plutôt une valeur de 0.015.\bigskip

Donc, si l'on ne connait pas vraiment l'état des vagues, on ne peut pas vraiment estimer le coefficient de trainée de l'équation \ref{eq:orgf49269f} sans le coefficient de Charnock.
Par contre, le \href{https://codes.ecmwf.int/grib/param-db/148}{site du modèle ECWAM} mentionne ceci :

\begin{quote}
\emph{This parameter accounts for increased aerodynamic roughness as wave heights grow due to increasing surface stress. It depends on the wind speed, wave age and other aspects of the sea state and is used to calculate how much the waves slow down the wind.}

\emph{When the atmospheric model is run without the ocean model, this parameter has a constant value of 0.018. When the atmospheric model is coupled to the ocean model, this parameter is calculated by the ECMWF Wave Model.}
\end{quote}

et l'article de \Textcite[p.163]{janssen2004interaction} mentionnne

\begin{quote}
\emph{The constant \(\hat{\alpha}\) was chosen in such a way
that for old windsea the Charnock parameter [\(\alpha_{ch}\)] has the value of 0.0185 in
agreement with observations collected by Wu (1982) on the drag over sea
waves.}
\end{quote}

Donc, c'est pourquoi j'ai pris la valeur de 0.0185 pour calculer le vent à 10 mètre de la surface, à l'aide des relations de la sous-section \ref{orgffa9632}.

\section{Ce que Wavewatch III voit en input}
\label{sec:org2917b12}

Comme la \emph{switch} ST3 est activée, le modèle utilise le module \emph{wavewatch/ftn/w3src3md.ftn} et donc il calcule la \emph{friction velocity} à l'aide de la sous-routine \emph{CALC USTAR(WINDSPEED,TAUW,USTAR,Z0,CHARN)}.
Plus précisément,
\begin{enumerate}
\item Il calcule la partie du \textbf{transfert de momentum vers les vagues} \(\tau_w\) (\emph{wave supported stress}) à \textbf{l'aide de tables} (voir sous-routine \emph{w3sin3} dans \emph{wavewatch/ftn/w3src3md.ftn}).
\item Il \textbf{se sert de nouveau de tables} pour trouver la \textbf{vitesse de friction} \(u_*\) (\emph{friction velocity)} en fonction du transfert de momentum aux vagues \(\tau_w\) ou \(\tau_{IN}\);
\item Il calcule le \textbf{coefficient de trainée} \(c_D\) à l'aide de la relation
\begin{equation}
   c_d = \qty(\venti\frac{u_*}{u_{10}})^2;
\end{equation}
\item Il calcule la \textbf{rugosité} \(z_0\) (\emph{roughness lenght}) à l'aide de
\begin{equation}
   z_0 = 10 \exp \qty(-\kappa \sqrt{c_D});
\end{equation}
\item Il trouve le \textbf{paramètre de Charnok} \(/alpha_{ch}\) và l'aide de 
\begin{equation}
   \alpha_{ch} = \frac{z_0 g}{u_*^2}.
\end{equation}
\end{enumerate}
