2023/mega-doc.org
** Tableau et résumé des quantités physiques importantes

J'ai réunis dans le tableau suivant tous les paramètres physiques intéressants pour recréer les expériences.

#+attr_latex: :align lllll
|------------------+-------------------------------------+-------------------------------------+---------------------+------------------|
|------------------+-------------------------------------+-------------------------------------+---------------------+------------------|
|                  | Paramètres                          | Symbole                             |              Valeur | Unités           |
|------------------+-------------------------------------+-------------------------------------+---------------------+------------------|
| *Modèles en eau* | Taille du domaine                   | L_x = L_y                           |                2000 | km               |
| *peu profonde*   | Nombre de points                    | n_x = n_y                           |                 513 | --               |
|                  | Pas de temps                        | $\Delta t$                          |                 300 | s                |
|                  | Paramètre de Coriolis               | f                                   |      7\times10^{-5} | rad s^{-1}  |
|                  | Amplitude du vent                   | \tau_{atm}                          |                 0.1 | N m^{-2}         |
|                  | Coef. d'hyperviscosité              | A_h                                 |  dx^4 \times10^{-5} | s^{-1}           |
|                  | Coef. de frottement au fond         | r_{drag}                            |             10^{-7} | s^{-1}           |
|                  | Épaisseur de la couche en surface   | H_1                                 |                 482 | m                |
|                  | Épaisseur de la seconde couche      | H_2                                 |                1042 | m                |
|                  | Épaisseur de la couche au fond      | H_3                                 |                2475 | m                |
|                  | Densité de l'eau (première couche)  | \rho_1                              |             1026.42 | kg m^{-3}        |
|                  | Densité de l'eau (seconde couche)   | \rho_2                              |             1027.27 | kg m^{-3}        |
|                  | Densité de l'eau (troisième couche) | \rho_3                              |             1027.87 | kg m^{-3}        |
|                  | Gravité réduite (seconde couche)    | g_2'                                | 8.01 \times 10^{-3} | ms^{-2}          |
|                  | Gravité réduite (troisième couche)  | g_3'                                | 5.80 \times 10^{-3} | ms^{-2}          |
|------------------+-------------------------------------+-------------------------------------+---------------------+------------------|
|------------------+-------------------------------------+-------------------------------------+---------------------+------------------|
| *Modèles*        | Taille du domaine (incluant terre)  | L_y = L_y                           |        \sim 2023.39 | km               |
| *Wavewatch III*  | Nombre de points de grille          | n_x = n_y                           |                 173 | --               |
|                  | Taille du domaine couplé            | L_y^* = L_x^*                       |                2000 | km               |
|                  | Nombre de points de grilles couplés | n_x^* = n_y^*                       |                 171 | --               |
|                  | Pas de temps global maximum         | $\Delta t_g$                        |                 300 | s                |
|                  | Pas de temps max. (Cond. CFL x,y)   | $\Delta t_{\pt CFL}^{\pt x,y}$      |                 150 | s                |
|                  | Pas de temps max. (Cond. CFL x,y)   | $\Delta t_{\pt CFL}^{\pt k,\theta}$ |                 150 | s                |
|                  | Pas de temps min. des termes source | $\Delta t_{Src}$                    |                  50 | s                |
|                  | Coef. de réflection au mur          | R_0                                 |                 0.1 | --               |
|                  | Densité de l'air                    | \rho_a                              |               1.225 | Kg m^{-3}        |
|------------------+-------------------------------------+-------------------------------------+---------------------+------------------|
| *Vent*           | Stress maximum du vent              | \tau_0                              |                 0.1 | N m^{-1}         |
|                  | Écart de variation (/Step/)         | S                                   |                0.05 | --               |
|                  | Accélération gravitationnelle       | g                                   |                9.81 | m s^{-2}         |
|                  | Constante de Von Karmann            | \kappa                              |                 0.41 | --               |
|                  | Coefficient de Charnok              | \alpha_{Ch}                         |              0.0185 | --               |
|                  | Densité de l'air                    | \rho_a                              |               1.225 | kg m^{-3}        |
|------------------+-------------------------------------+-------------------------------------+---------------------+------------------|




** Switches du modèles Wavewatch III

Le modèle Wavewatch III est modulable à l'aide de /switches/, voici celles qui ont été utilisées dans le cadre de cette recherche. 

#+attr_latex: :align cl
|-------+------------------------------------------------------------------------------------|
|-------+------------------------------------------------------------------------------------|
| Nom   | Description                                                                        |
|-------+------------------------------------------------------------------------------------|
| F90   | FORTRAN-90 style date and time capturing and program abort.                        |
| NOGRB | No GRIB package included.                                                          |
| NOPA  | Compilation as a stand-alone program.                                              |
| LRB4  | 4 bytes words in direct acces files.                                               |
| NC4   | Use NetCDF4.                                                                       |
| DIST  | Distributed memory model.                                                          |
| MPI   | Use MPI.                                                                           |
| PR3   | Propagation scheme : Higher-order schemes with Tolman (2002a) averaging technique. |
| UQ    | Third-order (UQ) propagation scheme.                                               |
| FLX0  | Flux computation : No routine used; flux computation included in source terms.     |
| LN1   | Linear input : Cavaleri and Malanotte-Rizzoli with filter.                         |
| ST3   | Input and dissipation : WAM4 and variants source term package.                     |
| NL1   | Non-linear interactions : Discrete interaction approximation (DIA).                |
| BT0   | Bottom friction : No bottom friction used.                                         |
| DB0   | No depth-induced breaking used.                                                    |
| TR0   | No triad interactions used.                                                        |
| BS0   | No bottom scattering used.                                                         |
| IS0   | No-damping by sea-ice.                                                             |
| REF1  | Enables reflection of shorelines and icebergs.                                     |
| XX0   | No supplemental source term used.                                                  |
| WNT1  | Wind input interpolation (time) : Linear interpolation.                            |
| WNX0  | Wind input interpolation (space) : No interpolation.                               |
| CRT0  | Current input interpolation (time) : No interpolation.                             |
| CRX0  | Current input interpolation (time) : No interpolation.                             |
| TRKNC | Activates the NetCDF API in the wave system tracking post-processing program.      |
| O0    | Output of namelists in grid preprocessor.                                          |
| 01    | Output of boundary points in grid preprocessor.                                    |
| 02    | Output of the grid point status map in grid preprocessor.                          |
|-------+------------------------------------------------------------------------------------|

* Faire fonctionner les modèles couplées

Voici les étapes à suivre pour faire rouler les deux modèles sur Oxygen.

** Compilation du modèle /shallow water/

Avant tout, il faut aller dans le répertoire du modèle /shallow water/.
Dans le cas qui nous intéresse, le modèle sur Oxygen se trouve au répertoire
#+begin_src bash
   >>> cd aos/home/celizotte/Desktop/Modele-shallow-water-multicouche/
#+end_src
\nb À chaque fois qu'on modifie le modèle /shallow water/, il faut le recompiler.

