2023/Fichiers_tex/mega-doc.tex



\section{Tableau et résumé des quantités physiques importantes}
\label{sec:orgc91cfae}

J'ai réunis dans le tableau suivant tous les paramètres physiques intéressants pour recréer les expériences.

\begin{center}
\begin{tabular}{lllll}
\hline
\hline
 & Paramètres & Symbole & Valeur & Unités\\[0pt]
\hline
\textbf{Modèles en eau} & Taille du domaine & L\textsubscript{x} = L\textsubscript{y} & 2000 & km\\[0pt]
\textbf{peu profonde} & Nombre de points & n\textsubscript{x} = n\textsubscript{y} & 513 & --\\[0pt]
 & Pas de temps & \(\Delta t\) & 300 & s\\[0pt]
 & Paramètre de Coriolis & f & 7\texttimes{}10\textsuperscript{-5} & rad s\textsuperscript{-1}\\[0pt]
 & Amplitude du vent & \(\tau\)\textsubscript{atm} & 0.1 & N m\textsuperscript{-2}\\[0pt]
 & Coef. d'hyperviscosité & A\textsubscript{h} & dx\textsuperscript{4} \texttimes{}10\textsuperscript{-5} & s\textsuperscript{-1}\\[0pt]
 & Coef. de frottement au fond & r\textsubscript{drag} & 10\textsuperscript{-7} & s\textsuperscript{-1}\\[0pt]
 & Épaisseur de la couche en surface & H\textsubscript{1} & 482 & m\\[0pt]
 & Épaisseur de la seconde couche & H\textsubscript{2} & 1042 & m\\[0pt]
 & Épaisseur de la couche au fond & H\textsubscript{3} & 2475 & m\\[0pt]
 & Densité de l'eau (première couche) & \(\rho\)\textsubscript{1} & 1026.42 & kg m\textsuperscript{-3}\\[0pt]
 & Densité de l'eau (seconde couche) & \(\rho\)\textsubscript{2} & 1027.27 & kg m\textsuperscript{-3}\\[0pt]
 & Densité de l'eau (troisième couche) & \(\rho\)\textsubscript{3} & 1027.87 & kg m\textsuperscript{-3}\\[0pt]
 & Gravité réduite (seconde couche) & g\textsubscript{2}' & 8.01 \texttimes{} 10\textsuperscript{-3} & ms\textsuperscript{-2}\\[0pt]
 & Gravité réduite (troisième couche) & g\textsubscript{3}' & 5.80 \texttimes{} 10\textsuperscript{-3} & ms\textsuperscript{-2}\\[0pt]
\hline
\hline
\textbf{Modèles} & Taille du domaine (incluant terre) & L\textsubscript{y} = L\textsubscript{y} & \(\sim\) 2023.39 & km\\[0pt]
\textbf{Wavewatch III} & Nombre de points de grille & n\textsubscript{x} = n\textsubscript{y} & 173 & --\\[0pt]
 & Taille du domaine couplé & L\textsubscript{y}\textsuperscript{*} = L\textsubscript{x}\textsuperscript{*} & 2000 & km\\[0pt]
 & Nombre de points de grilles couplés & n\textsubscript{x}\textsuperscript{*} = n\textsubscript{y}\textsuperscript{*} & 171 & --\\[0pt]
 & Pas de temps global maximum & \(\Delta t_g\) & 300 & s\\[0pt]
 & Pas de temps max. (Cond. CFL x,y) & \(\Delta t_{\pt CFL}^{\pt x,y}\) & 150 & s\\[0pt]
 & Pas de temps max. (Cond. CFL x,y) & \(\Delta t_{\pt CFL}^{\pt k,\theta}\) & 150 & s\\[0pt]
 & Pas de temps min. des termes source & \(\Delta t_{Src}\) & 50 & s\\[0pt]
 & Coef. de réflection au mur & R\textsubscript{0} & 0.1 & --\\[0pt]
 & Densité de l'air & \(\rho\)\textsubscript{a} & 1.225 & Kg m\textsuperscript{-3}\\[0pt]
\hline
\textbf{Vent} & Stress maximum du vent & \(\tau\)\textsubscript{0} & 0.1 & N m\textsuperscript{-1}\\[0pt]
 & Écart de variation (\emph{Step}) & S & 0.05 & --\\[0pt]
 & Accélération gravitationnelle & g & 9.81 & m s\textsuperscript{-2}\\[0pt]
 & Constante de Von Karmann & \(\kappa\) & 0.41 & --\\[0pt]
 & Coefficient de Charnok & \(\gamma\)\textsubscript{Ch} & 0.0185 & --\\[0pt]
 & Densité de l'air & \(\rho\)\textsubscript{a} & 1.225 & kg m\textsuperscript{-3}\\[0pt]
\hline
\end{tabular}
\end{center}




\section{Switches du modèles Wavewatch III}
\label{sec:orgbe9ae1d}

Le modèle Wavewatch III est modulable à l'aide de \emph{switches}, voici celles qui ont été utilisées dans le cadre de cette recherche. 

\begin{center}
\begin{tabular}{cl}
\hline
\hline
Nom & Description\\[0pt]
\hline
F90 & FORTRAN-90 style date and time capturing and program abort.\\[0pt]
NOGRB & No GRIB package included.\\[0pt]
NOPA & Compilation as a stand-alone program.\\[0pt]
LRB4 & 4 bytes words in direct acces files.\\[0pt]
NC4 & Use NetCDF4.\\[0pt]
DIST & Distributed memory model.\\[0pt]
MPI & Use MPI.\\[0pt]
PR3 & Propagation scheme : Higher-order schemes with Tolman (2002a) averaging technique.\\[0pt]
UQ & Third-order (UQ) propagation scheme.\\[0pt]
FLX0 & Flux computation : No routine used; flux computation included in source terms.\\[0pt]
LN1 & Linear input : Cavaleri and Malanotte-Rizzoli with filter.\\[0pt]
ST3 & Input and dissipation : WAM4 and variants source term package.\\[0pt]
NL1 & Non-linear interactions : Discrete interaction approximation (DIA).\\[0pt]
BT0 & Bottom friction : No bottom friction used.\\[0pt]
DB0 & No depth-induced breaking used.\\[0pt]
TR0 & No triad interactions used.\\[0pt]
BS0 & No bottom scattering used.\\[0pt]
IS0 & No-damping by sea-ice.\\[0pt]
REF1 & Enables reflection of shorelines and icebergs.\\[0pt]
XX0 & No supplemental source term used.\\[0pt]
WNT1 & Wind input interpolation (time) : Linear interpolation.\\[0pt]
WNX0 & Wind input interpolation (space) : No interpolation.\\[0pt]
CRT0 & Current input interpolation (time) : No interpolation.\\[0pt]
CRX0 & Current input interpolation (time) : No interpolation.\\[0pt]
TRKNC & Activates the NetCDF API in the wave system tracking post-processing program.\\[0pt]
O0 & Output of namelists in grid preprocessor.\\[0pt]
01 & Output of boundary points in grid preprocessor.\\[0pt]
02 & Output of the grid point status map in grid preprocessor.\\[0pt]
\hline
\end{tabular}
\end{center}

\chapter{Faire fonctionner les modèles couplées}
\label{sec:org493df68}

Voici les étapes à suivre pour faire rouler les deux modèles sur Oxygen.

\section{Compilation du modèle \emph{shallow water}}
\label{sec:org28f1ca3}

Avant tout, il faut aller dans le répertoire du modèle \emph{shallow water}.
Dans le cas qui nous intéresse, le modèle sur Oxygen se trouve au répertoire
\begin{verbatim}
   >>> cd aos/home/celizotte/Desktop/Modele-shallow-water-multicouche/
\end{verbatim}
\nb À chaque fois qu'on modifie le modèle \emph{shallow water}, il faut le recompiler.
