2023/mega-doc.org
*** Modifier le fichier « parameters.f90 »

Toutes les /switches/ et les paramètres à modifier se retrouvent dans le fichier /parameters.f90/.
Si l'on veut que le modèle soit couplé avec Wavewatch, il faut absolument utiliser la /switch/ COU = .true.\bigskip

Un exemple de fichier de paramètres pour les modèles couplés est fournit sous le nom de /parameters COU.f90/.
Tandis qu'un version non-couplée est fournit sous le nom de /parameters tmp.f90/. 

*** Compilation du modèle avec l'exécutable « compile model »

Une fois les paramètres modifiés à souhait, il faut compiler le modèle /shallow water/ à l'aide de l'exécutable /compile model/.
Lorsque ce dernier sera exécuté, il suffit de rentrer la valeur « 1 », pour signifier la compilation avec Oxygen.
#+begin_src bash
   >>> ./compile_model
   !! Enter machine: 1) Oxygen (McGill computer); computer 2) Bepsi (personal computer); 3) Beluga
   (Compute Canada)
   >>> 1
   !! Using setting for Oxygen with fishpack stored at ${fishpack_path} and lapack at ${lapack_path}
   !! Parameters file copied from ${model_path} to ${case}
   !! Compilation of $case/exec completed on the computer Oxygen.
#+end_src
Une fois compilé, l'exécutable du modèle « /exec/ » se déplace automatiquement dans le dossier /newcase/, ainsi qu'un copie des paramètres utilisées pour la compilation. 

** Compilation du modèle Wavewatch III

La compilation du modèle /Wavewatch III/ n'est nécessaire qu'une seule fois -- à moins que vous modifiez le fichier de /switches/, ce qui arrive rarement. 

*** Compilation du modèle avec l'exécutable « make oxygen »

** Création des inputs et assimilation par Wavewatch III

*** Création d'un nouveau cas 

** Rouler les modèles en MPI 

\newpage

#+print_bibliography:
