2023/Fichiers_tex/mega-doc.tex

\subsection{Modifier le fichier « parameters.f90 »}
\label{sec:org58ae5ad}

Toutes les \emph{switches} et les paramètres à modifier se retrouvent dans le fichier \emph{parameters.f90}.
Si l'on veut que le modèle soit couplé avec Wavewatch, il faut absolument utiliser la \emph{switch} COU = .true.\bigskip

Un exemple de fichier de paramètres pour les modèles couplés est fournit sous le nom de \emph{parameters COU.f90}.
Tandis qu'un version non-couplée est fournit sous le nom de \emph{parameters tmp.f90}. 

\subsection{Compilation du modèle avec l'exécutable « compile model »}
\label{sec:org1640b51}

Une fois les paramètres modifiés à souhait, il faut compiler le modèle \emph{shallow water} à l'aide de l'exécutable \emph{compile model}.
Lorsque ce dernier sera exécuté, il suffit de rentrer la valeur « 1 », pour signifier la compilation avec Oxygen.
\begin{verbatim}
   >>> ./compile_model
   !! Enter machine: 1) Oxygen (McGill computer); computer 2) Bepsi (personal computer); 3) Beluga
   (Compute Canada)
   >>> 1
   !! Using setting for Oxygen with fishpack stored at ${fishpack_path} and lapack at ${lapack_path}
   !! Parameters file copied from ${model_path} to ${case}
   !! Compilation of $case/exec completed on the computer Oxygen.
\end{verbatim}
Une fois compilé, l'exécutable du modèle « \emph{exec} » se déplace automatiquement dans le dossier \emph{newcase}, ainsi qu'un copie des paramètres utilisées pour la compilation. 

\section{Compilation du modèle Wavewatch III}
\label{sec:orgea39763}

La compilation du modèle \emph{Wavewatch III} n'est nécessaire qu'une seule fois -- à moins que vous modifiez le fichier de \emph{switches}, ce qui arrive rarement. 

\subsection{Compilation du modèle avec l'exécutable « make oxygen »}
\label{sec:org4bb563c}

\section{Création des inputs et assimilation par Wavewatch III}
\label{sec:orgd9aa137}

\subsection{Création d'un nouveau cas}
\label{sec:org1567173}

\section{Rouler les modèles en MPI}
\label{sec:orgcc16562}

\newpage

\printbibliography
\end{document}